#### Terraform Format and Style 🖌
#### Terraform Initialization ⚙️
#### Terraform Validation 🤖

**Success! The configuration is valid.**

#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```hcl
[command]/home/runner/work/_temp/5282555e-847e-40fa-8215-a166b7690163/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security.aws_security_group.main will be created
  + resource "aws_security_group" "main" {
      + arn                    = (known after apply)
      + description            = "Main security group for dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-main-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Description" = "Security groups for dev environment"
          + "Environment" = "dev"
          + "Name"        = "dev-sg"
        }
      + tags_all               = {
          + "CreatedBy"   = "terraform"
          + "Description" = "Security groups for dev environment"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-sg"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.security.aws_security_group_rule.ingress_http will be created
  + resource "aws_security_group_rule" "ingress_http" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.security.aws_security_group_rule.ingress_https will be created
  + resource "aws_security_group_rule" "ingress_https" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-private-1"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-private-1"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-private-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-private-2"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-private-3"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-private-3"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-public-1"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-public-1"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-public-2"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-public-2"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "Name"        = "dev-public-3"
        }
      + tags_all                                       = {
          + "CreatedBy"   = "terraform"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-public-3"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Description" = "Main VPC for dev environment"
          + "Environment" = "dev"
          + "Name"        = "dev-vpc"
        }
      + tags_all                             = {
          + "CreatedBy"   = "terraform"
          + "Description" = "Main VPC for dev environment"
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "dev-vpc"
          + "Project"     = "boltbay"
          + "Workspace"   = "dev"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Amodule.vpc.data.aws_availability_zones.available: Reading...%0Amodule.vpc.data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-2]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.security.aws_security_group.main will be created%0A  + resource "aws_security_group" "main" {%0A      + arn                    = (known after apply)%0A      + description            = "Main security group for dev"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "dev-main-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Description" = "Security groups for dev environment"%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-sg"%0A        }%0A      + tags_all               = {%0A          + "CreatedBy"   = "terraform"%0A          + "Description" = "Security groups for dev environment"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-sg"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.security.aws_security_group_rule.egress will be created%0A  + resource "aws_security_group_rule" "egress" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 0%0A      + id                       = (known after apply)%0A      + protocol                 = "-1"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 0%0A      + type                     = "egress"%0A    }%0A%0A  # module.security.aws_security_group_rule.ingress_http will be created%0A  + resource "aws_security_group_rule" "ingress_http" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 80%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 80%0A      + type                     = "ingress"%0A    }%0A%0A  # module.security.aws_security_group_rule.ingress_https will be created%0A  + resource "aws_security_group_rule" "ingress_https" {%0A      + cidr_blocks              = [%0A          + "0.0.0.0/0",%0A        ]%0A      + from_port                = 443%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 443%0A      + type                     = "ingress"%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-private-1"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-private-1"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-private-2"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-private-2"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] will be created%0A  + resource "aws_subnet" "private" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-private-3"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-private-3"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-public-1"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-public-1"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-public-2"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-public-2"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_subnet.public[2] will be created%0A  + resource "aws_subnet" "public" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "ap-southeast-2c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-public-3"%0A        }%0A      + tags_all                                       = {%0A          + "CreatedBy"   = "terraform"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-public-3"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc.aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = true%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Description" = "Main VPC for dev environment"%0A          + "Environment" = "dev"%0A          + "Name"        = "dev-vpc"%0A        }%0A      + tags_all                             = {%0A          + "CreatedBy"   = "terraform"%0A          + "Description" = "Main VPC for dev environment"%0A          + "Environment" = "dev"%0A          + "ManagedBy"   = "terraform"%0A          + "Name"        = "dev-vpc"%0A          + "Project"     = "boltbay"%0A          + "Workspace"   = "dev"%0A        }%0A    }%0A%0APlan: 11 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + private_subnet_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_ids  = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_id             = (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
```

</details>

*Pushed by: @LH-Song, Environment: `dev`*